"""
Создайте матрицу размером 3х3 и выведите значения с индексами 1,2 и 3,3
"""

matrix = [
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9]
]

# Вывод значений с индексами 1, 2
print("Значения с индексами 1,2:", matrix[0][1], matrix[0][2])

# Вывод значения с индексами 3,3
print("Значение с индексами 3,3:", matrix[2][2])
